7767517
408 481
Input                    in0                      0 1 in0
Convolution              conv_92                  1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_23                  1 1 1 2
Split                    splitncnn_0              1 2 2 3 4
Convolution              conv_93                  1 1 4 5 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=512
Swish                    silu_24                  1 1 5 6
Convolution              conv_94                  1 1 6 7 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_25                  1 1 7 8
Pooling                  maxpool2d_2              1 1 3 9 0=0 1=2 11=2 12=2 13=0 2=2 3=0 5=0
Concat                   cat_0                    2 1 8 9 10 0=0
Convolution              conv_95                  1 1 10 11 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_26                  1 1 11 12
Split                    splitncnn_1              1 2 12 13 14
ConvolutionDepthWise     convdw_156               1 1 14 15 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=288 7=32
Convolution              conv_96                  1 1 15 16 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_27                  1 1 16 17
Convolution              conv_97                  1 1 13 18 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_28                  1 1 18 19
ConvolutionDepthWise     convdw_157               1 1 19 20 0=48 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432 7=48
Convolution              conv_98                  1 1 20 21 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_29                  1 1 21 22
Concat                   cat_1                    2 1 17 22 23 0=0
ShuffleChannel           channelshuffle_76        1 1 23 24 0=2 1=0
Slice                    tensor_split_0           1 2 24 25 26 -23300=2,48,-233 1=0
Convolution              conv_99                  1 1 26 27 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_30                  1 1 27 28
ConvolutionDepthWise     convdw_158               1 1 28 29 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              conv_100                 1 1 29 30 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_31                  1 1 30 31
Concat                   cat_2                    2 1 25 31 32 0=0
ShuffleChannel           channelshuffle_77        1 1 32 33 0=2 1=0
Slice                    tensor_split_1           1 2 33 34 35 -23300=2,48,-233 1=0
Convolution              conv_101                 1 1 35 36 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_32                  1 1 36 37
ConvolutionDepthWise     convdw_159               1 1 37 38 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              conv_102                 1 1 38 39 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_33                  1 1 39 40
Concat                   cat_3                    2 1 34 40 41 0=0
ShuffleChannel           channelshuffle_78        1 1 41 42 0=2 1=0
Slice                    tensor_split_2           1 2 42 43 44 -23300=2,48,-233 1=0
Convolution              conv_103                 1 1 44 45 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_34                  1 1 45 46
ConvolutionDepthWise     convdw_160               1 1 46 47 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=432 7=48
Convolution              conv_104                 1 1 47 48 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
Swish                    silu_35                  1 1 48 49
Concat                   cat_4                    2 1 43 49 50 0=0
ShuffleChannel           channelshuffle_79        1 1 50 51 0=2 1=0
Split                    splitncnn_2              1 3 51 52 53 54
ConvolutionDepthWise     convdw_161               1 1 54 55 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              conv_105                 1 1 55 56 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_36                  1 1 56 57
Convolution              conv_106                 1 1 53 58 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_37                  1 1 58 59
ConvolutionDepthWise     convdw_162               1 1 59 60 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Convolution              conv_107                 1 1 60 61 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_38                  1 1 61 62
Concat                   cat_5                    2 1 57 62 63 0=0
ShuffleChannel           channelshuffle_80        1 1 63 64 0=2 1=0
Slice                    tensor_split_3           1 2 64 65 66 -23300=2,96,-233 1=0
Convolution              conv_108                 1 1 66 67 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_39                  1 1 67 68
ConvolutionDepthWise     convdw_163               1 1 68 69 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_109                 1 1 69 70 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_40                  1 1 70 71
Concat                   cat_6                    2 1 65 71 72 0=0
ShuffleChannel           channelshuffle_81        1 1 72 73 0=2 1=0
Slice                    tensor_split_4           1 2 73 74 75 -23300=2,96,-233 1=0
Convolution              conv_110                 1 1 75 76 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_41                  1 1 76 77
ConvolutionDepthWise     convdw_164               1 1 77 78 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_111                 1 1 78 79 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_42                  1 1 79 80
Concat                   cat_7                    2 1 74 80 81 0=0
ShuffleChannel           channelshuffle_82        1 1 81 82 0=2 1=0
Slice                    tensor_split_5           1 2 82 83 84 -23300=2,96,-233 1=0
Convolution              conv_112                 1 1 84 85 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_43                  1 1 85 86
ConvolutionDepthWise     convdw_165               1 1 86 87 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_113                 1 1 87 88 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_44                  1 1 88 89
Concat                   cat_8                    2 1 83 89 90 0=0
ShuffleChannel           channelshuffle_83        1 1 90 91 0=2 1=0
Slice                    tensor_split_6           1 2 91 92 93 -23300=2,96,-233 1=0
Convolution              conv_114                 1 1 93 94 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_45                  1 1 94 95
ConvolutionDepthWise     convdw_166               1 1 95 96 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_115                 1 1 96 97 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_46                  1 1 97 98
Concat                   cat_9                    2 1 92 98 99 0=0
ShuffleChannel           channelshuffle_84        1 1 99 100 0=2 1=0
Slice                    tensor_split_7           1 2 100 101 102 -23300=2,96,-233 1=0
Convolution              conv_116                 1 1 102 103 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_47                  1 1 103 104
ConvolutionDepthWise     convdw_167               1 1 104 105 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_117                 1 1 105 106 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_48                  1 1 106 107
Concat                   cat_10                   2 1 101 107 108 0=0
ShuffleChannel           channelshuffle_85        1 1 108 109 0=2 1=0
Slice                    tensor_split_8           1 2 109 110 111 -23300=2,96,-233 1=0
Convolution              conv_118                 1 1 111 112 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_49                  1 1 112 113
ConvolutionDepthWise     convdw_168               1 1 113 114 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_119                 1 1 114 115 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_50                  1 1 115 116
Concat                   cat_11                   2 1 110 116 117 0=0
ShuffleChannel           channelshuffle_86        1 1 117 118 0=2 1=0
Slice                    tensor_split_9           1 2 118 119 120 -23300=2,96,-233 1=0
Convolution              conv_120                 1 1 120 121 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_51                  1 1 121 122
ConvolutionDepthWise     convdw_169               1 1 122 123 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Convolution              conv_121                 1 1 123 124 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_52                  1 1 124 125
Concat                   cat_12                   2 1 119 125 126 0=0
ShuffleChannel           channelshuffle_87        1 1 126 127 0=2 1=0
Split                    splitncnn_3              1 3 127 128 129 130
ConvolutionDepthWise     convdw_170               1 1 130 131 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728 7=192
Convolution              conv_122                 1 1 131 132 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_53                  1 1 132 133
Convolution              conv_123                 1 1 129 134 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_54                  1 1 134 135
ConvolutionDepthWise     convdw_171               1 1 135 136 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1728 7=192
Convolution              conv_124                 1 1 136 137 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_55                  1 1 137 138
Concat                   cat_13                   2 1 133 138 139 0=0
ShuffleChannel           channelshuffle_88        1 1 139 140 0=2 1=0
Slice                    tensor_split_10          1 2 140 141 142 -23300=2,192,-233 1=0
Convolution              conv_125                 1 1 142 143 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_56                  1 1 143 144
ConvolutionDepthWise     convdw_172               1 1 144 145 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Convolution              conv_126                 1 1 145 146 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_57                  1 1 146 147
Concat                   cat_14                   2 1 141 147 148 0=0
ShuffleChannel           channelshuffle_89        1 1 148 149 0=2 1=0
Slice                    tensor_split_11          1 2 149 150 151 -23300=2,192,-233 1=0
Convolution              conv_127                 1 1 151 152 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_58                  1 1 152 153
ConvolutionDepthWise     convdw_173               1 1 153 154 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Convolution              conv_128                 1 1 154 155 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_59                  1 1 155 156
Concat                   cat_15                   2 1 150 156 157 0=0
ShuffleChannel           channelshuffle_90        1 1 157 158 0=2 1=0
Slice                    tensor_split_12          1 2 158 159 160 -23300=2,192,-233 1=0
Convolution              conv_129                 1 1 160 161 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_60                  1 1 161 162
ConvolutionDepthWise     convdw_174               1 1 162 163 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Convolution              conv_130                 1 1 163 164 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_61                  1 1 164 165
Concat                   cat_16                   2 1 159 165 166 0=0
ShuffleChannel           channelshuffle_91        1 1 166 167 0=2 1=0
Convolution              conv_131                 1 1 167 168 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_62                  1 1 168 169
Split                    splitncnn_4              1 2 169 170 171
Pooling                  maxpool2d_3              1 1 171 172 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_5              1 2 172 173 174
Pooling                  maxpool2d_4              1 1 174 175 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_6              1 2 175 176 177
Pooling                  maxpool2d_5              1 1 177 178 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_17                   4 1 170 173 176 178 179 0=0
Convolution              conv_132                 1 1 179 180 0=384 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=294912
Swish                    silu_63                  1 1 180 181
Convolution              conv_133                 1 1 181 182 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_64                  1 1 182 183
Split                    splitncnn_7              1 2 183 184 185
Interp                   interpolate_0            1 1 185 186 0=1 1=2.0 2=2.0 6=0
Concat                   cat_18                   2 1 186 128 187 0=0
ConvolutionDepthWise     convdw_175               1 1 187 188 0=288 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2592 7=288
Swish                    silu_65                  1 1 188 189
Convolution              conv_134                 1 1 189 190 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Swish                    silu_66                  1 1 190 191
Convolution              conv_135                 1 1 191 192 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_67                  1 1 192 193
Split                    splitncnn_8              1 2 193 194 195
Interp                   interpolate_1            1 1 195 196 0=1 1=2.0 2=2.0 6=0
Concat                   cat_19                   2 1 196 52 197 0=0
ConvolutionDepthWise     convdw_176               1 1 197 198 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Swish                    silu_68                  1 1 198 199
Convolution              conv_136                 1 1 199 200 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=18432
Swish                    silu_69                  1 1 200 201
Split                    splitncnn_9              1 3 201 202 203 204
ConvolutionDepthWise     convdw_177               1 1 204 205 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Swish                    silu_70                  1 1 205 206
Convolution              conv_137                 1 1 206 207 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Split                    splitncnn_10             1 2 207 208 209
Sigmoid                  sigmoid_6                1 1 209 210
BinaryOp                 mul_0                    2 1 208 210 211 0=2
BinaryOp                 add_1                    2 1 211 194 212 0=0
ConvolutionDepthWise     convdw_178               1 1 212 213 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Swish                    silu_71                  1 1 213 214
Convolution              conv_138                 1 1 214 215 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_72                  1 1 215 216
Split                    splitncnn_11             1 3 216 217 218 219
ConvolutionDepthWise     convdw_179               1 1 219 220 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864 7=96
Swish                    silu_73                  1 1 220 221
Convolution              conv_139                 1 1 221 222 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Split                    splitncnn_12             1 2 222 223 224
Sigmoid                  sigmoid_7                1 1 224 225
BinaryOp                 mul_2                    2 1 223 225 226 0=2
BinaryOp                 add_3                    2 1 226 184 227 0=0
ConvolutionDepthWise     convdw_180               1 1 227 228 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=864 7=96
Swish                    silu_74                  1 1 228 229
Convolution              conv_140                 1 1 229 230 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_75                  1 1 230 231
Split                    splitncnn_13             1 2 231 232 233
MemoryData               pnnx_982                 0 1 234 0=80 1=80 2=96
BinaryOp                 add_4                    2 1 234 202 235 0=0
Convolution              conv_141                 1 1 235 236 0=21 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2016
MemoryData               pnnx_986                 0 1 237 0=80 1=80 2=21
BinaryOp                 mul_5                    2 1 237 236 238 0=2
Convolution              conv_142                 1 1 203 239 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Concat                   cat_20                   2 1 238 239 240 0=0
Reshape                  reshape_150              1 1 240 241 0=80 1=80 11=19 2=3
Permute                  permute_147              1 1 241 242 0=3
Slice                    tensor_split_13          1 2 242 243 244 -23300=2,7,-233 1=3
Sigmoid                  sigmoid_8                1 1 243 245
Slice                    tensor_split_14          1 3 245 246 247 248 -23300=3,2,2,-233 1=3
MemoryData               pnnx_1013                0 1 249 0=2 1=80 11=80 2=1
BinaryOp                 mul_6                    1 1 246 250 0=2 1=1 2=2.0
BinaryOp                 sub_7                    1 1 250 251 0=1 1=1 2=0.5
BinaryOp                 add_8                    2 1 251 249 252 0=0
BinaryOp                 mul_9                    1 1 252 253 0=2 1=1 2=8.0
MemoryData               pnnx_1757                0 1 254 0=2 1=1 11=1 2=3
BinaryOp                 mul_10                   1 1 247 255 0=2 1=1 2=2.0
UnaryOp                  pow_11                   1 1 255 256 0=4
BinaryOp                 mul_12                   2 1 256 254 257 0=2
Slice                    tensor_split_15          1 12 244 258 259 260 261 262 263 264 265 266 267 268 269 -23300=12,1,1,1,1,1,1,1,1,1,1,1,-233 1=3
MemoryData               pnnx_1046                0 1 270 0=1 1=80 11=80 2=1
BinaryOp                 mul_13                   1 1 258 271 0=2 1=1 2=2.0
BinaryOp                 sub_14                   1 1 271 272 0=1 1=1 2=0.5
BinaryOp                 add_15                   2 1 272 270 273 0=0
BinaryOp                 mul_16                   1 1 273 274 0=2 1=1 2=8.0
MemoryData               pnnx_1059                0 1 275 0=1 1=80 11=80 2=1
BinaryOp                 mul_17                   1 1 259 276 0=2 1=1 2=2.0
BinaryOp                 sub_18                   1 1 276 277 0=1 1=1 2=0.5
BinaryOp                 add_19                   2 1 277 275 278 0=0
BinaryOp                 mul_20                   1 1 278 279 0=2 1=1 2=8.0
Sigmoid                  sigmoid_9                1 1 260 280
MemoryData               pnnx_1046_pnnxshadow1    0 1 281 0=1 1=80 11=80 2=1
BinaryOp                 mul_21                   1 1 261 282 0=2 1=1 2=2.0
BinaryOp                 sub_22                   1 1 282 283 0=1 1=1 2=0.5
BinaryOp                 add_23                   2 1 283 281 284 0=0
BinaryOp                 mul_24                   1 1 284 285 0=2 1=1 2=8.0
MemoryData               pnnx_1059_pnnxshadow1    0 1 286 0=1 1=80 11=80 2=1
BinaryOp                 mul_25                   1 1 262 287 0=2 1=1 2=2.0
BinaryOp                 sub_26                   1 1 287 288 0=1 1=1 2=0.5
BinaryOp                 add_27                   2 1 288 286 289 0=0
BinaryOp                 mul_28                   1 1 289 290 0=2 1=1 2=8.0
Sigmoid                  sigmoid_10               1 1 263 291
MemoryData               pnnx_1046_pnnxshadow2    0 1 292 0=1 1=80 11=80 2=1
BinaryOp                 mul_29                   1 1 264 293 0=2 1=1 2=2.0
BinaryOp                 sub_30                   1 1 293 294 0=1 1=1 2=0.5
BinaryOp                 add_31                   2 1 294 292 295 0=0
BinaryOp                 mul_32                   1 1 295 296 0=2 1=1 2=8.0
MemoryData               pnnx_1059_pnnxshadow2    0 1 297 0=1 1=80 11=80 2=1
BinaryOp                 mul_33                   1 1 265 298 0=2 1=1 2=2.0
BinaryOp                 sub_34                   1 1 298 299 0=1 1=1 2=0.5
BinaryOp                 add_35                   2 1 299 297 300 0=0
BinaryOp                 mul_36                   1 1 300 301 0=2 1=1 2=8.0
Sigmoid                  sigmoid_11               1 1 266 302
MemoryData               pnnx_1046_pnnxshadow3    0 1 303 0=1 1=80 11=80 2=1
BinaryOp                 mul_37                   1 1 267 304 0=2 1=1 2=2.0
BinaryOp                 sub_38                   1 1 304 305 0=1 1=1 2=0.5
BinaryOp                 add_39                   2 1 305 303 306 0=0
BinaryOp                 mul_40                   1 1 306 307 0=2 1=1 2=8.0
MemoryData               pnnx_1059_pnnxshadow3    0 1 308 0=1 1=80 11=80 2=1
BinaryOp                 mul_41                   1 1 268 309 0=2 1=1 2=2.0
BinaryOp                 sub_42                   1 1 309 310 0=1 1=1 2=0.5
BinaryOp                 add_43                   2 1 310 308 311 0=0
BinaryOp                 mul_44                   1 1 311 312 0=2 1=1 2=8.0
Sigmoid                  sigmoid_12               1 1 269 313
Concat                   cat_21                   15 1 253 257 248 274 279 280 285 290 291 296 301 302 307 312 313 314 0=3
Reshape                  reshape_151              1 1 314 315 0=19 1=19200
MemoryData               pnnx_1173                0 1 316 0=40 1=40 2=96
BinaryOp                 add_45                   2 1 316 217 317 0=0
Convolution              conv_143                 1 1 317 318 0=21 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2016
MemoryData               pnnx_1177                0 1 319 0=40 1=40 2=21
BinaryOp                 mul_46                   2 1 319 318 320 0=2
Convolution              conv_144                 1 1 218 321 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Concat                   cat_22                   2 1 320 321 322 0=0
Reshape                  reshape_152              1 1 322 323 0=40 1=40 11=19 2=3
Permute                  permute_148              1 1 323 324 0=3
Slice                    tensor_split_16          1 2 324 325 326 -23300=2,7,-233 1=3
Sigmoid                  sigmoid_13               1 1 325 327
Slice                    tensor_split_17          1 3 327 328 329 330 -23300=3,2,2,-233 1=3
MemoryData               pnnx_1204                0 1 331 0=2 1=40 11=40 2=1
BinaryOp                 mul_47                   1 1 328 332 0=2 1=1 2=2.0
BinaryOp                 sub_48                   1 1 332 333 0=1 1=1 2=0.5
BinaryOp                 add_49                   2 1 333 331 334 0=0
BinaryOp                 mul_50                   1 1 334 335 0=2 1=1 2=16.0
MemoryData               pnnx_1760                0 1 336 0=2 1=1 11=1 2=3
BinaryOp                 mul_51                   1 1 329 337 0=2 1=1 2=2.0
UnaryOp                  pow_52                   1 1 337 338 0=4
BinaryOp                 mul_53                   2 1 338 336 339 0=2
Slice                    tensor_split_18          1 12 326 340 341 342 343 344 345 346 347 348 349 350 351 -23300=12,1,1,1,1,1,1,1,1,1,1,1,-233 1=3
MemoryData               pnnx_1237                0 1 352 0=1 1=40 11=40 2=1
BinaryOp                 mul_54                   1 1 340 353 0=2 1=1 2=2.0
BinaryOp                 sub_55                   1 1 353 354 0=1 1=1 2=0.5
BinaryOp                 add_56                   2 1 354 352 355 0=0
BinaryOp                 mul_57                   1 1 355 356 0=2 1=1 2=16.0
MemoryData               pnnx_1250                0 1 357 0=1 1=40 11=40 2=1
BinaryOp                 mul_58                   1 1 341 358 0=2 1=1 2=2.0
BinaryOp                 sub_59                   1 1 358 359 0=1 1=1 2=0.5
BinaryOp                 add_60                   2 1 359 357 360 0=0
BinaryOp                 mul_61                   1 1 360 361 0=2 1=1 2=16.0
Sigmoid                  sigmoid_14               1 1 342 362
MemoryData               pnnx_1237_pnnxshadow1    0 1 363 0=1 1=40 11=40 2=1
BinaryOp                 mul_62                   1 1 343 364 0=2 1=1 2=2.0
BinaryOp                 sub_63                   1 1 364 365 0=1 1=1 2=0.5
BinaryOp                 add_64                   2 1 365 363 366 0=0
BinaryOp                 mul_65                   1 1 366 367 0=2 1=1 2=16.0
MemoryData               pnnx_1250_pnnxshadow1    0 1 368 0=1 1=40 11=40 2=1
BinaryOp                 mul_66                   1 1 344 369 0=2 1=1 2=2.0
BinaryOp                 sub_67                   1 1 369 370 0=1 1=1 2=0.5
BinaryOp                 add_68                   2 1 370 368 371 0=0
BinaryOp                 mul_69                   1 1 371 372 0=2 1=1 2=16.0
Sigmoid                  sigmoid_15               1 1 345 373
MemoryData               pnnx_1237_pnnxshadow2    0 1 374 0=1 1=40 11=40 2=1
BinaryOp                 mul_70                   1 1 346 375 0=2 1=1 2=2.0
BinaryOp                 sub_71                   1 1 375 376 0=1 1=1 2=0.5
BinaryOp                 add_72                   2 1 376 374 377 0=0
BinaryOp                 mul_73                   1 1 377 378 0=2 1=1 2=16.0
MemoryData               pnnx_1250_pnnxshadow2    0 1 379 0=1 1=40 11=40 2=1
BinaryOp                 mul_74                   1 1 347 380 0=2 1=1 2=2.0
BinaryOp                 sub_75                   1 1 380 381 0=1 1=1 2=0.5
BinaryOp                 add_76                   2 1 381 379 382 0=0
BinaryOp                 mul_77                   1 1 382 383 0=2 1=1 2=16.0
Sigmoid                  sigmoid_16               1 1 348 384
MemoryData               pnnx_1237_pnnxshadow3    0 1 385 0=1 1=40 11=40 2=1
BinaryOp                 mul_78                   1 1 349 386 0=2 1=1 2=2.0
BinaryOp                 sub_79                   1 1 386 387 0=1 1=1 2=0.5
BinaryOp                 add_80                   2 1 387 385 388 0=0
BinaryOp                 mul_81                   1 1 388 389 0=2 1=1 2=16.0
MemoryData               pnnx_1250_pnnxshadow3    0 1 390 0=1 1=40 11=40 2=1
BinaryOp                 mul_82                   1 1 350 391 0=2 1=1 2=2.0
BinaryOp                 sub_83                   1 1 391 392 0=1 1=1 2=0.5
BinaryOp                 add_84                   2 1 392 390 393 0=0
BinaryOp                 mul_85                   1 1 393 394 0=2 1=1 2=16.0
Sigmoid                  sigmoid_17               1 1 351 395
Concat                   cat_23                   15 1 335 339 330 356 361 362 367 372 373 378 383 384 389 394 395 396 0=3
Reshape                  reshape_153              1 1 396 397 0=19 1=4800
MemoryData               pnnx_1364                0 1 398 0=20 1=20 2=96
BinaryOp                 add_86                   2 1 398 232 399 0=0
Convolution              conv_145                 1 1 399 400 0=21 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2016
MemoryData               pnnx_1368                0 1 401 0=20 1=20 2=21
BinaryOp                 mul_87                   2 1 401 400 402 0=2
Convolution              conv_146                 1 1 233 403 0=36 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3456
Concat                   cat_24                   2 1 402 403 404 0=0
Reshape                  reshape_154              1 1 404 405 0=20 1=20 11=19 2=3
Permute                  permute_149              1 1 405 406 0=3
Slice                    tensor_split_19          1 2 406 407 408 -23300=2,7,-233 1=3
Sigmoid                  sigmoid_18               1 1 407 409
Slice                    tensor_split_20          1 3 409 410 411 412 -23300=3,2,2,-233 1=3
MemoryData               pnnx_1395                0 1 413 0=2 1=20 11=20 2=1
BinaryOp                 mul_88                   1 1 410 414 0=2 1=1 2=2.0
BinaryOp                 sub_89                   1 1 414 415 0=1 1=1 2=0.5
BinaryOp                 add_90                   2 1 415 413 416 0=0
BinaryOp                 mul_91                   1 1 416 417 0=2 1=1 2=32.0
MemoryData               pnnx_1763                0 1 418 0=2 1=1 11=1 2=3
BinaryOp                 mul_92                   1 1 411 419 0=2 1=1 2=2.0
UnaryOp                  pow_93                   1 1 419 420 0=4
BinaryOp                 mul_94                   2 1 420 418 421 0=2
Slice                    tensor_split_21          1 12 408 422 423 424 425 426 427 428 429 430 431 432 433 -23300=12,1,1,1,1,1,1,1,1,1,1,1,-233 1=3
MemoryData               pnnx_1428                0 1 434 0=1 1=20 11=20 2=1
BinaryOp                 mul_95                   1 1 422 435 0=2 1=1 2=2.0
BinaryOp                 sub_96                   1 1 435 436 0=1 1=1 2=0.5
BinaryOp                 add_97                   2 1 436 434 437 0=0
BinaryOp                 mul_98                   1 1 437 438 0=2 1=1 2=32.0
MemoryData               pnnx_1441                0 1 439 0=1 1=20 11=20 2=1
BinaryOp                 mul_99                   1 1 423 440 0=2 1=1 2=2.0
BinaryOp                 sub_100                  1 1 440 441 0=1 1=1 2=0.5
BinaryOp                 add_101                  2 1 441 439 442 0=0
BinaryOp                 mul_102                  1 1 442 443 0=2 1=1 2=32.0
Sigmoid                  sigmoid_19               1 1 424 444
MemoryData               pnnx_1428_pnnxshadow1    0 1 445 0=1 1=20 11=20 2=1
BinaryOp                 mul_103                  1 1 425 446 0=2 1=1 2=2.0
BinaryOp                 sub_104                  1 1 446 447 0=1 1=1 2=0.5
BinaryOp                 add_105                  2 1 447 445 448 0=0
BinaryOp                 mul_106                  1 1 448 449 0=2 1=1 2=32.0
MemoryData               pnnx_1441_pnnxshadow1    0 1 450 0=1 1=20 11=20 2=1
BinaryOp                 mul_107                  1 1 426 451 0=2 1=1 2=2.0
BinaryOp                 sub_108                  1 1 451 452 0=1 1=1 2=0.5
BinaryOp                 add_109                  2 1 452 450 453 0=0
BinaryOp                 mul_110                  1 1 453 454 0=2 1=1 2=32.0
Sigmoid                  sigmoid_20               1 1 427 455
MemoryData               pnnx_1428_pnnxshadow2    0 1 456 0=1 1=20 11=20 2=1
BinaryOp                 mul_111                  1 1 428 457 0=2 1=1 2=2.0
BinaryOp                 sub_112                  1 1 457 458 0=1 1=1 2=0.5
BinaryOp                 add_113                  2 1 458 456 459 0=0
BinaryOp                 mul_114                  1 1 459 460 0=2 1=1 2=32.0
MemoryData               pnnx_1441_pnnxshadow2    0 1 461 0=1 1=20 11=20 2=1
BinaryOp                 mul_115                  1 1 429 462 0=2 1=1 2=2.0
BinaryOp                 sub_116                  1 1 462 463 0=1 1=1 2=0.5
BinaryOp                 add_117                  2 1 463 461 464 0=0
BinaryOp                 mul_118                  1 1 464 465 0=2 1=1 2=32.0
Sigmoid                  sigmoid_21               1 1 430 466
MemoryData               pnnx_1428_pnnxshadow3    0 1 467 0=1 1=20 11=20 2=1
BinaryOp                 mul_119                  1 1 431 468 0=2 1=1 2=2.0
BinaryOp                 sub_120                  1 1 468 469 0=1 1=1 2=0.5
BinaryOp                 add_121                  2 1 469 467 470 0=0
BinaryOp                 mul_122                  1 1 470 471 0=2 1=1 2=32.0
MemoryData               pnnx_1441_pnnxshadow3    0 1 472 0=1 1=20 11=20 2=1
BinaryOp                 mul_123                  1 1 432 473 0=2 1=1 2=2.0
BinaryOp                 sub_124                  1 1 473 474 0=1 1=1 2=0.5
BinaryOp                 add_125                  2 1 474 472 475 0=0
BinaryOp                 mul_126                  1 1 475 476 0=2 1=1 2=32.0
Sigmoid                  sigmoid_22               1 1 433 477
Concat                   cat_25                   15 1 417 421 412 438 443 444 449 454 455 460 465 466 471 476 477 478 0=3
Reshape                  reshape_155              1 1 478 479 0=19 1=1200
Concat                   cat_26                   3 1 315 397 479 out0 0=0
