7767517
24 25
Input                    in0                      0 1 in0
Convolution              convrelu_0               1 1 in0 1 0=8 1=5 11=5 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=600 9=1
Convolution              convrelu_1               1 1 1 2 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 9=1
Convolution              convrelu_2               1 1 2 3 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 9=1
Convolution              convrelu_3               1 1 3 4 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 9=1
Pooling                  maxpool2d_1              1 1 4 5 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_4               1 1 5 6 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608 9=1
Convolution              convrelu_5               1 1 6 7 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216 9=1
Pooling                  maxpool2d_2              1 1 7 8 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_6               1 1 8 9 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=13824 9=1
Convolution              convrelu_7               1 1 9 10 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736 9=1
Pooling                  maxpool2d_3              1 1 10 11 0=0 1=3 11=3 12=2 13=0 2=2 3=0 5=0
Convolution              convrelu_8               1 1 11 12 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=27648 9=1
Convolution              convrelu_9               1 1 12 13 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728 9=1
Split                    splitncnn_0              1 2 13 14 15
Convolution              convrelu_10              1 1 15 16 0=12 1=3 11=3 12=1 13=2 14=0 2=1 3=2 4=0 5=1 6=13824 9=1
Convolution              conv_27                  1 1 16 17 0=5 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=60
Pooling                  gap_0                    1 1 17 18 0=1 4=1
Reshape                  reshape_30               1 1 18 19 0=1 1=1 2=-1
Flatten                  flatten_31               1 1 19 out1
Pooling                  maxpool2d_4              1 1 14 21 0=0 1=2 11=5 12=1 13=0 2=1 3=1 5=1
Convolution              conv_28                  1 1 21 22 0=78 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9984
Squeeze                  squeeze_32               1 1 22 23 -23303=1,1
Permute                  permute_29               1 1 23 out0 0=1
